src/InformationRegisters/Scan_СоставСоглашенийОПоставке/Scan_СоставСоглашенийОПоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_СоставСоглашенийОПоставке</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СоглашениеОПоставке</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </resources>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ТипыСоглашенийОПоставке/Scan_ТипыСоглашенийОПоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ТипыСоглашенийОПоставке</name>
  <enumValues>
    <name>ЗаявкаНаСОП</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаСОПSRU</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Scan_СоглашенияОПоставке/Scan_СоглашенияОПоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СоглашенияОПоставке</name>
  <basedOn>Catalog.Scan_СоглашенияОПоставке</basedOn>
  <basedOn>Catalog.Scan_СпециальныеУсловия</basedOn>
  <attributes>
    <name>DDS</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FFU</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>IDПродуктаКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SORDER</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоммерческоеПредложениеSPORT</name>
    <type>
      <types>CatalogRef.Scan_КоммерческиеПредложения</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйКлиент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйКлиентКомпания</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кузовостроитель</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоПродукту</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоммерческогоПредложенияSPORT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоммерческогоПредложенияSPORTДляЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСОП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Scan_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродавецДилера</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РегиональныйМенеджер</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециальныеУсловия</name>
    <type>
      <types>CatalogRef.Scan_СпециальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартнаяСпецификация</name>
    <type>
      <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.Scan_ТипыСтатусовЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоглашенияОПоставке</name>
    <type>
      <types>EnumRef.Scan_ТипыСоглашенийОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальностьСпецификации</name>
    <type>
      <types>EnumRef.Scan_ТипыСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветКабины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФальшрадиаторнойРешетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСоглашенияОПоставке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.Scan_СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяРазмещениеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявкиНаСОПSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДилераSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийSRUSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаБУПродукты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийИзУТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрепленныйМенеджерОКП</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютнаяОговорка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаАвтобусы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаРезерв</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходнаяЗаявка</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УсловияОплаты</name>
    <attributes>
      <name>ПроцентОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокОплатыАванса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрайняяДатаОплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетДатыОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыРасчетаДатыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПродуктов</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
        <types>CatalogRef.Scan_ДрафтыПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентДрайв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпециальныеУсловия</name>
      <type>
        <types>CatalogRef.Scan_СпециальныеУсловия</types>
      </type>
    </attributes>
    <attributes>
      <name>DDЗапрошенная</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DDS</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладОтгрузки</name>
      <type>
        <types>CatalogRef.Scan_Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Драйв</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПоВалютнойОговорке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПерерасчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикПлатежей</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/Scan_СоставСоглашенийОПоставке/ManagerModule.bsl
&НаСервере
Функция ПолучитьСписокИзделий(СоглашениеОПоставке) экспорт
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_СоставСоглашенийОПоставкеСрезПоследних.Изделие КАК Продукт,
		|	Scan_СоставСоглашенийОПоставкеСрезПоследних.СоглашениеОПоставке КАК СоглашениеОПоставке
		|ИЗ
		|	РегистрСведений.Scan_СоставСоглашенийОПоставке.СрезПоследних КАК Scan_СоставСоглашенийОПоставкеСрезПоследних
		|ГДЕ
		|	Scan_СоставСоглашенийОПоставкеСрезПоследних.СоглашениеОПоставке = &СоглашениеОПоставке";
	
	Запрос.УстановитьПараметр("СоглашениеОПоставке", СоглашениеОПоставке);
	
	СоставСоглашения = Запрос.Выполнить().Выгрузить(); 	
	
	возврат СоставСоглашения;
	
КонецФункции

&НаСервере
Функция ПолучитьСоглашениеОПоставке(Изделие) экспорт
	
	СоглашениеДляВозврата = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_СоставСоглашенийОПоставкеСрезПоследних.Изделие КАК Продукт,
		|	Scan_СоставСоглашенийОПоставкеСрезПоследних.СоглашениеОПоставке КАК СоглашениеОПоставке
		|ИЗ
		|	РегистрСведений.Scan_СоставСоглашенийОПоставке.СрезПоследних КАК Scan_СоставСоглашенийОПоставкеСрезПоследних
		|ГДЕ
		|	Scan_СоставСоглашенийОПоставкеСрезПоследних.Изделие = &Изделие";
	
	Запрос.УстановитьПараметр("Изделие", Изделие);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СоглашениеДляВозврата = Выборка.СоглашениеОПоставке;	
	КонецЕсли; 
	
	возврат СоглашениеДляВозврата;
	
КонецФункции

&НаСервере
Процедура ЗаписатьСоставСоглашения(ТекущийСоставСоглашения, СоглашениеОПоставке, Отказ, ПривязанныеЗаказы = Неопределено) Экспорт //rarus vikhle 14.12.2020 mt 16977  добавил параметр отказ //rarus vikhle 03.09.2021 mt 17933 + ПривязанныеЗаказы
	//rarus vikhle 30.06.2020 mt 15888 +++
	НачатьТранзакцию();
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.Scan_СоставСоглашенийОПоставке");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ТекущийСоставСоглашения;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Изделие","Продукт");
	БлокировкаДанных.Заблокировать();
	//rarus vikhle 30.06.2020 mt 15888 ---
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Продукт КАК ТекущийПродукт
		|ПОМЕСТИТЬ ВТ_ТЗ
		|ИЗ
		|	&ТаблицаЗаписей КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_СоставСоглашенийОПоставкеСрезПоследних.Изделие КАК Изделие
		|ПОМЕСТИТЬ ВТ_ПрошлыеИзделия
		|ИЗ
		|	РегистрСведений.Scan_СоставСоглашенийОПоставке.СрезПоследних КАК Scan_СоставСоглашенийОПоставкеСрезПоследних
		|ГДЕ
		|	Scan_СоставСоглашенийОПоставкеСрезПоследних.СоглашениеОПоставке = &СоглашениеОПоставке
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_СоставСоглашенийОПоставкеСрезПоследних.Изделие КАК Изделие,
		//rarus vikhle 17.12.2020 mt 16181 +++
		|	Scan_СоставСоглашенийОПоставкеСрезПоследних.СоглашениеОПоставке.НомерСоглашенияОПоставке КАК НомерЗаявки
		//rarus vikhle 17.12.2020 mt 16181 ---
		|ПОМЕСТИТЬ ЗанятыеИзделия
		|ИЗ
		|	РегистрСведений.Scan_СоставСоглашенийОПоставке.СрезПоследних(
		|			,
		|			Изделие В
		|				(ВЫБРАТЬ
		|					ВТ_ТЗ.ТекущийПродукт
		|				ИЗ
		|					ВТ_ТЗ КАК ВТ_ТЗ)) КАК Scan_СоставСоглашенийОПоставкеСрезПоследних
		|ГДЕ
		|	НЕ Scan_СоставСоглашенийОПоставкеСрезПоследних.СоглашениеОПоставке В (&СоглашениеОПоставке)
		|	И Scan_СоставСоглашенийОПоставкеСрезПоследних.СоглашениеОПоставке <> ЗНАЧЕНИЕ(Справочник.Scan_СоглашенияОПоставке.ПустаяСсылка)
		|	И НЕ Scan_СоставСоглашенийОПоставкеСрезПоследних.СоглашениеОПоставке.Статус В (&Статусы)
		//rarus vikhle 13.08.2021 mt 17834 +++
		|	И ВЫБОР
		|			КОГДА НЕ &НаОснованииЗаявкиSRU
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ НЕ Scan_СоставСоглашенийОПоставкеСрезПоследних.СоглашениеОПоставке.ТипСоглашенияОПоставке = ЗНАЧЕНИЕ(Перечисление.Scan_ТипыСоглашенийОПоставке.ЗаявкаНаСОПSRU)
		|		КОНЕЦ
		//rarus vikhle 13.08.2021 mt 17834 ---
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗанятыеИзделия.Изделие КАК Изделие,
		//rarus vikhle 17.12.2020 mt 16181 +++
		|	ЗанятыеИзделия.НомерЗаявки КАК НомерЗаявки
		//rarus vikhle 17.12.2020 mt 16181 +++
		|ИЗ
		|	ЗанятыеИзделия КАК ЗанятыеИзделия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПрошлыеИзделия.Изделие КАК ПрошлыйПродукт,
		|	ВТ_ТЗ.ТекущийПродукт КАК ТекущийПродукт,
		//rarus vikhle 03.09.2021 mt 17933 +++
		|	ВТ_ТЗ.ТекущийПродукт.ЗаказНаЗавод КАК ЗаказНаЗавод
		//rarus vikhle 03.09.2021 mt 17933 ---
		|ИЗ
		|	ВТ_ТЗ КАК ВТ_ТЗ
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ПрошлыеИзделия КАК ВТ_ПрошлыеИзделия
		|		ПО ВТ_ТЗ.ТекущийПродукт = ВТ_ПрошлыеИзделия.Изделие
		|ГДЕ
		|	НЕ ВТ_ПрошлыеИзделия.Изделие В
		|				(ВЫБРАТЬ
		|					ЗанятыеИзделия.Изделие
		|				ИЗ
		|					ЗанятыеИзделия КАК ЗанятыеИзделия)";
	//rarus vikhle 18.08.2020 mt 16181 +-
	
	//rarus vikhle 10.11.2020 mt 16181 +++
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.Отказ);
	МассивСтатусов.Добавить(Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.СОП_Отменен);
	МассивСтатусов.Добавить(Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.СОП_Расторгнут);
	МассивСтатусов.Добавить(Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.НеактуальноЕстьДС);
	МассивСтатусов.Добавить(Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.ПроектЗаявкиНаСОП);
	//rarus vikhle 10.11.2020 mt 16181 ---
	
	Запрос.УстановитьПараметр("ТаблицаЗаписей", ТекущийСоставСоглашения);
	Запрос.УстановитьПараметр("СоглашениеОпоставке", СоглашениеОпоставке);
	//Запрос.УстановитьПараметр("ПрошлаяВерсияСоглашения", СоглашениеОпоставке.Основание); //rarus vikhle 10.11.2020 mt 16181	
	Запрос.УстановитьПараметр("Статусы", МассивСтатусов); //rarus vikhle 10.11.2020 mt 16181
	
	//rarus vikhle 13.08.2021 mt 17834 +++
	// Для заявок на СОП на основании заявки на СОП SRU не проверяем вхождение продуктов в заявки на СОП SRU
	Если ТипЗнч(СоглашениеОПоставке.Основание) = Тип("СправочникСсылка.Scan_СоглашенияОПоставке") 
		И Не СоглашениеОПоставке.Основание.Пустая() Тогда
		ЗаявкаНаОснованииЗаявкиSRU = СоглашениеОПоставке.Основание.ТипСоглашенияОПоставке = Перечисления.Scan_ТипыСоглашенийОПоставке.ЗаявкаНаСОПSRU;
	Иначе	
		ЗаявкаНаОснованииЗаявкиSRU = Ложь;	
	КонецЕсли;	
	Запрос.УстановитьПараметр("НаОснованииЗаявкиSRU", ЗаявкаНаОснованииЗаявкиSRU);
	//rarus vikhle 13.08.2021 mt 17834 ---
	
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	ЗанятыеИзделия	=	МассивРезультатовЗапроса[3].Выгрузить();
	
	Для Каждого СтрокаИзделия Из ЗанятыеИзделия Цикл
		//ВывестиСообщениеПол(НСтр("ru = 'Продукт %1 уже указан в другой заявке!'"),,,,,СтрокаИзделия.Изделие);
		ВывестиСообщениеПол(НСтр("ru = 'Продукт ""%1"" уже указан в заявке № %2'"),,,,,СтрокаИзделия.Изделие,СтрокаИзделия.НомерЗаявки);//rarus vikhle 17.12.2020 mt 16181
		Отказ = Истина;//rarus vikhle 14.12.2020 mt 16977
	КонецЦикла;
		
	ТЧ 	=	МассивРезультатовЗапроса[4].Выгрузить(); 
	//rarus vikhle 30.06.2020 mt 15888 ---
		
	// Необходимо обработать 2 варианта
	// 1. Добавлено новое изделие в соглашение о поставке.
	// 2. Удалено изделие из соглашения о поставке.
	// 3. Изделие было и осталось.
	
	Для каждого СтрокаПродукта Из ТЧ Цикл
		// Вариант 1
		Если СтрокаПродукта.ПрошлыйПродукт = Null Тогда
			// Изделие добавили
			НоваяЗапись = РегистрыСведений.Scan_СоставСоглашенийОПоставке.СоздатьМенеджерЗаписи();
			НоваяЗапись.Изделие = СтрокаПродукта.ТекущийПродукт;
			НоваяЗапись.Период = ТекущаяДатаСеанса();
			НоваяЗапись.СоглашениеОПоставке = СоглашениеОПоставке;
			НоваяЗапись.Записать();
			
			// Добавим в массив заказов для дальнейшей проверки модуле объекта на необходимость добавления записи по заказам в регистр "Scan_ОчередьDD2DDSИнформера"
			Если ТипЗнч(ПривязанныеЗаказы) = Тип("Массив") Тогда //rarus vikhle 08.09.2021 mt 17933
				ПривязанныеЗаказы.Добавить(СтрокаПродукта.ЗаказНаЗавод); //rarus vikhle 01.09.2021 mt 17933 +++
			КонецЕсли;	
			
		КонецЕсли;
		
		// Вариант 2
		Если СтрокаПродукта.ТекущийПродукт = Null Тогда
			// Изделие удалили
			НоваяЗапись = РегистрыСведений.Scan_СоставСоглашенийОПоставке.СоздатьМенеджерЗаписи();
			НоваяЗапись.Изделие = СтрокаПродукта.ПрошлыйПродукт;
			НоваяЗапись.Период = ТекущаяДатаСеанса();
			НоваяЗапись.СоглашениеОПоставке = Справочники.Scan_СоглашенияОПоставке.ПустаяСсылка();
			НоваяЗапись.Записать();
		КонецЕсли;
	КонецЦикла; 
	ЗафиксироватьТранзакцию();//rarus vikhle 30.06.2020 mt 15888	
КонецПроцедуры
